<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>PayloadDisplayName</key>
		<string>BlahDNS (Japan) DNS over HTTPS</string>
		<key>PayloadOrganization</key>
		<string>BlahDNS</string>
		<key>PayloadDescription</key>
		<string>This profile enables BlahDNS (Japan) DNS over HTTPS on all networks using the iOS 14 / iPadOS 14 / tvOS 14 / macOS Big Sur Encrypted DNS feature.</string>
		<key>ConsentText</key>
		<dict>
			<key>default</key>
			<string>Privacy policy:
https://blahdns.com</string>
		</dict>
		<key>PayloadIdentifier</key>
		<string>com.paulmillr.apple-dns.blahdns-japan-doh</string>
		<key>PayloadScope</key>
		<string>User</string>
		<key>PayloadType</key>
		<string>Configuration</string>
		<key>PayloadUUID</key>
		<string>3ac76bbe-dc66-4078-adc7-c172cd904b1b</string>
		<key>PayloadVersion</key>
		<integer>1</integer>
		<key>PayloadContent</key>
		<array>
			<dict>
				<key>DNSSettings</key>
				<dict>
					<key>DNSProtocol</key>
					<string>HTTPS</string>
					<key>ServerAddresses</key>
					<array>
						<string>139.162.112.47</string>
						<string>2400:8902::f03c:92ff:fe27:344b</string>
					</array>
					<key>ServerURL</key>
					<string>https://doh-jp.blahdns.com/dns-query</string>
				</dict>
				<key>PayloadType</key>
				<string>com.apple.dnsSettings.managed</string>
				<key>PayloadIdentifier</key>
				<string>51b4aa71-c669-4b9d-8897-3c6cd05f683c</string>
				<key>PayloadUUID</key>
				<string>22713002-14e1-4024-8a7a-65ddf0596a13</string>
				<key>PayloadDisplayName</key>
				<string>BlahDNS (Japan) DNS over HTTPS</string>
				<key>PayloadVersion</key>
				<integer>1</integer>
			</dict>
		</array>
	</dict>
</plist>
